import keyboard
import TTS
import STT
import sys
import win32api

lang = 0 # английский, 1 - русский

def delete_word(word, sentence):
    index_begin = sentence.find(word)
    sentence = sentence[:index_begin] + sentence[index_begin + len(word):]
    return sentence


def SearchInCatalog(catalog, query, command):
    for construction in catalog:
        for variant in catalog[construction]:
            if variant in query:
                command = command + "+" + construction
                query = delete_word(variant, query)
    return query, command


possible_words = [{ #английская раскладка
    'stop': ['стоп', 'хватит', 'замолчи', 'перестань', 'заткнись'],
    'lang': ['поменяй раскладку', 'раскладка', 'раскладку', 'поменяй язык', 'измени язык', 'cмени раскладку'],
    'ctrl': ['контроль', 'control', 'ctrl'],
    'shift': ['shift', 'шифт'],
    'space': ['space', 'пробел'],
    'f5': ['f5', 'ф5'],
    'esc': ['escape', 'чизкейк', 'эскейп'],
    'enter': ['enter', 'энтер', 'ввод', 'центр'],
    83: ['вверх'],
    84: ['вниз'],
    79: ['влево', 'налево'],
    89: ['вправо', 'направо'],
    'shift+=': ['плюс', '+'],
    '=': ['равно', '='],
    'shift+1': ['восклицательный', '!'],
    'shift+2': ['собака', 'собаку', 'собачка', '@'],
    'shift+3': ['решётка', '#'],
    'shift+4': ['доллар', '$'],
    'shift+6': ['степень', 'в степени', '^'],
    'shift+7': ['амперсант', 'амперсанд', '&'],
    'shift+`': ['эквивалентность', '~'],
    '-': [' вертикальная кавычка', '`'],
    'backspace': ['backspace', 'бэкспейс'],
    'alt': ['альт', 'alt'],
    '1': ['1', 'один', 'первый', 'первая', 'первое', 'единичка', 'единица'],
    '2': ['2', 'два', 'второй', 'вторая', 'второе', 'двоечка', 'двойка'],
    '3': ['3', 'три', 'третий', 'третья', 'третье', 'троечка', 'тройка'],
    '4': ['4', 'четыре', 'четвёртый', 'четвёртая', 'четвёртое', 'четвёрка', 'четвёрочка'],
    '5': ['5', 'пять', 'пятый', 'пятая', 'пятое', 'пятёрка', 'пятёрочка'],
    '6': ['6', 'шесть', 'шестой', 'шестая', 'шестое', 'шестёрка', 'шестёёрочка'],
    '7': ['7', 'семь', 'седьмой', 'седьмая', 'седьмое', 'семёрка', 'семёрочка'],
    '8': ['8', 'восемь', 'восьмой', 'восьмая', 'восьмое', 'восьмёрка', 'восьмёрочка'],
    '9': ['9', 'девять', 'девятый', 'девятая', 'девятое', 'дквяткаа', 'девяточка'],
    '0': ['0', 'ноль', 'нулевой', 'нулевая', 'нулевое', 'нолик'],
    'a': ['a'],
    'b': ['b'],
    'c': ['c'],
    'd': ['d'],
    'e': ['e'],
    'f': ['f'],
    'g': ['g'],
    'h': ['h'],
    'i': ['i'],
    'j': ['j'],
    'k': ['k'],
    'l': ['l'],
    'm': ['m'],
    'n': ['n'],
    'o': ['o'],
    'p': ['p'],
    'q': ['q'],
    'r': ['r'],
    's': ['s'],
    't': ['t'],
    'u': ['u'],
    'v': ['v'],
    'w': ['w', 'дабл ю', 'дубль в ', 'вперёд'],
    'x': ['x', 'икс'],
    'y': ['y', 'игрик'],
    'z': ['z'],
},\
                 { #русская раскладка
    'stop': ['стоп', 'хватит', 'замолчи', 'заткнись'],
    'lang': ['поменяй раскладку', 'раскладка', 'раскладку', 'поменяй язык', 'измени язык', 'cмени раскладку'],
    'ctrl': ['контроль', 'control', 'ctrl'],
    'shift': ['shift', 'шифт'],
    'space': ['space', 'пробел'],
    'f5': ['f5', 'ф5'],
    'esc': ['escape', 'чизкейк', 'эскейп'],
    'enter': ['enter', 'энтер'],
    'shift+=': ['плюс', '+'],
    '=': ['равно', '='],
    'shift+1': ['восклицательный', '!'],
    'shift+2': ['кавычка', '"'],
    'shift+3': ['номер', '№'],
    'shift+4': ['точка с запятой', ';'],
    'shift+5': ['процент', '%'],
    'shift+6': ['двоеточие', ':'],
    'shift+7': ['вопрос', '?'],
    'shift+8': ['звездочка', '*'],
    'shift+9': ['скобка открывающая', '('],
    'shift+0': ['скобка закрывающая', ')'],
    'shift+-': ['нижнее подчёркивание', '_'],
    '-': ['дефис', '-'],
    'а': ['а'],
    'б': ['б'],
    'в': ['в'],
    'г': ['г'],
    'д': ['д'],
    'е': ['е'],
    'ё': ['ё'],
    'ж': ['ж'],
    'з': ['з'],
    'и': ['и'],
    'й': ['й'],
    'к': ['к'],
    'л': ['л'],
    'м': ['м'],
    'н': ['н'],
    'о': ['о'],
    'п': ['п'],
    'р': ['р'],
    'с': ['с'],
    'т': ['т'],
    'у': ['у'],
    'ф': ['ф'],
    'х': ['х'],
    'ц': ['ц'],
    'ч': ['ч'],
    'щ': ['щ'],
    'ъ': ['ъ'],
    'ы': ['ы'],
    'ь': ['ь'],
    'э': ['э'],
    'ю': ['ю'],
    'я': ['я'],
}]


def Translate_Commands(query):
    global lang
    command = ""
    query, command = SearchInCatalog(possible_words[lang], query.lower(), command)

    if command == '':
        print("Не удалось распознать команду")
        return ""
    elif 'stop' in command:
        print("Программа завершена")
        sys.exit(0)
    elif 'lang' in command: # смена раскладки
        if lang:
            lang = 0
            TTS.talk("Вы перешли на английскую раскладку")
        else:
            lang = 1
            TTS.talk("Вы перешли на русскую раскладку")
    else:
        print(command[1:])
        keyboard.press_and_release(command[1:])


while True:
    Translate_Commands(STT.listen())